OpenFOAM/simpleFsi-OFv2112/cases/main-les-long/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    cylinder
    {
	type		kqRWallFunction;
	value		$internalField;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity	0.01;
        value		$internalField;
    }

    outlet
    {
	type		zeroGradient;
    }

    channel
    {
	type		kqRWallFunction;
	value		$internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
